- [x] 1.  Напишите программу расчета факториала используя цикл.
 
 - [x] 2.  Используя циклы и метод: Console.Write("*"), Console.Write(" "), Console.Write("\n") (для перехода на новую строку). Выведите на экран:
·          строку
·          прямоугольник
·          прямоугольный треугольник
·          равносторонний треугольник
·          ромб
Размер фигур задаем с консоли.
Сделать вариант как с заполненными фигурами так и только рамки.
 
- [x] 3. Напишите метод, который будет определять: 1) является ли введенное число положительным или отрицательным. 2) Является ли оно простым (используйте технику перебора значений). (Простое число — это натуральное число, которое делится на 1 и само на себя. Чтобы определить простое число или нет, следует найти все его целые делители. Если делителей больше 2-х, значит оно не простое.) 3) Делится ли на 2, 5, 3, 6, 9 без остатка.

- [x] 4. Имеется N клиентов, которым компания производитель должна доставить товар. Сколько существует возможных маршрутов доставки товара, с учетом того, что товар будет доставлять одна машина?  
Используя Visual Studio, создайте проект по шаблону Console Application.  
Напишите программу, которая будет рассчитывать, и выводить на экран количество возможных вариантов доставки товара. Для решения задачи, используйте факториал N!, рассчитываемый с помощью цикла do-while. 

- [x] 5. Дано два числа A и B (A<B) выведите сумму всех чисел расположенных между данными числами на экран. 
Дано два числа A и B (A<B) выведите все нечетные значения, расположенные между данными числами. 

- [x] 6. Дано натуральное число. Определить количество четных цифр в нем. 

- [x] 7.  Найти среднее арифметическое всех целых чисел от а до b (значения а и b вводятся с клавиатуры (b>=a)

- [x] 8. Начав тренировки, лыжник в первый день пробежал 10 км. Каждый следующий день он увеличивал пробег на 10% от пробега предыдущего дня. Определить в какой день суммарный пробег за все дни превысит 100 км.

- [x] 9. Напишите программу, которая вводит два целых числа и находит их произведение, не используя операцию умножения. Учтите, что числа могут быть отрицательными.

- [x] 10. Выведите все квадраты натуральных чисел, не превосходящие данного числа N.

- [ ] 11. Дано число k. Напишите программу, которая выводит все числа Фибоначчи, которые не превышают его.

- [ ] 12. Дано число k. Напишите программу, которая выводит k первых чисел Фибоначчи.

- [ ] 13. Вводится число. Преобразовать его в другое число, цифры которого будут следовать в обратном порядке по сравнению с введенным числом (переворот числа).

- [ ] 14. Определить из каких цифр состоит число (вводится число, нужно его распарсить и вывести по порядку все цифры, в него входящие).

- [ ] 15. Возвести число k в степень n.

- [ ] 16. Из натурального числа удалить заданную цифру. Число и цифру вводить с клавиатуры. Например, задано число 5683. Требуется удалить из него цифру 8. Получится число 563.

- [ ] 17. Дано целое число, состоящее из разных цифр. Определить, какая из цифр заданного числа больше, т. е. найти наибольшую цифру числа.

- [ ] 18. Проверка гипотезы Сиракуз. Возьмем любое натуральное число. Если оно четное - разделим его пополам, если нечетное - умножим на 3, прибавим 1 и разделим пополам. Повторим эти действия с вновь полученным числом. Гипотеза гласит, что независимо от выбора первого числа рано или поздно мы получим 1.

- [ ] 19. Отгадать целое число, которое "загадал" компьютер в определенном диапазоне.
Для генерации произвольного числа используем new Random().Next(). Вводя число в консоли, программа должна указывать больше загаданное число введенного или меньше. С каждой итерацией мы должны приближаться к разгадке загаданного числа и в конце-концов угадать.

- [ ] 20. Найти сумму n-го количества элементов ряда:
S = 1/2 - 2/4 + 3/8 - 4/16 + ... - ...
